{
    "home": "Inicio",
    "close": "Fechar",
    "save": "Salvar",
    "load": "Carregar",
    "cancel": "Cancelar",
    "select": "Selecionar",
    "confirm": "Confirmar",
    "new": "Novo",
    "current": "Atual",
    "lang": "Idiomas",
    "deleteTab": "Apagar essa aba",
    "options": "Opções",
    "dmg": "DMG",
    "partner": "Parceiros",
    "info": "INFORMAÇÕES",
    "contactInfo": "<b>CONTATO</b>: Use <a href=\"https://forms.gle/kUUBYNQA39uYxfQ26\" target=\"_blank\">esse formulário</a> se precisar entrar em contato.",
    "aboutInfo": "<b>DO SITE</b>: Feito de fã para fã, uma ferramenta para ajudar os jogadores. Esse site <b>não tem relação</b> com a KuroGames©.",
    "disclaimerInfo": "Termos como KuroGames, WutheringWaves, nomes de personagens, habilidades e outras redes sociais, assim como imagens de: personagens, icones de habilidade e outros icones, juntamente com audios representativos, são de propriedade de seus respectivos proprietários.",
    "donation": "Gostaria de agradeçer os desenvolvedores? <b>Divulge o site para seus amigos</b> ou me pague um café pelo Ko-Fi <a href=\"https://ko-fi.com/nfekted\" target=\"blank_\" style=\"color: white\">clicando aqui</a>, qualquer quantia é bem vinda :)",
    "x":"Veja essa calculadora de atributos para Wutherin Waves",
    "settings": {
        "settings": "Configurações",
        "audio": "Tocar audios no site",
        "autosave": "Salvar modificações automaticamente",
        "deleteSettings": "Apagar todos dados",
        "deleteConfirm": "Apagar todos os dados? Essa ação não pode ser desfeita"
    },
    "disclaimer": "Esse site não tem nenhuma relação direta com a KuroGames©. Para uma melhor experiencia, as suas configurações e valores cadastrados serão salvas em formato de coockies em seu navegador. Nenhum outro tipo de informação é coletada. Guias anonimas ou limpar o cache pode resultar na perca de seus registros permanentemente. Ao continuar o acesso, você concorda e tem ciência disso.",
    "subtitle": "Preencha os dados, compare status, analise echos, escolha a melhor opção, fique mais forte",
    "tools": "Mais ferramentas",
    "zzz": "ZZZ está vindo"
}