{
    "q1": "What is the purpose of the website?",
    "a1": "It's normal in games with RPG elements to have doubts about \"what's best to do?\". The calculations on this site aim to help predict possible changes in your status and make your character better suited to your game mode.",
    "q2": "How reliable are the calculations?",
    "a2": "Well, that's really hard to say, as Wuthering Waves (and practically all other games with RPG elements) have N variables for damage, such as: Atk, Critical Chance, Weapons, Special Effects, Buff's, Debuff's, enemy resistances and countless other variations.<br/><br/>Determining damage accurately is difficult (not to say impossible) without the source code/exact description of how each mechanic works.<br/><br/>In tests carried out the \"prediction of damage\" approached the expected in-game damage with a <b>variation always of 5%~7% on average</b>. Some examples:<br/> - Damage expected on an enemy without resistance <b>806</b>, in-game damage <b>837</b>.<br/> - Damage expected on an enemy without resistance (with buff damage) <b>903</b>, in-game damage <b>911</b>.<br/> - Damage expected on enemy with resistance <b>545</b>, in-game damage <b>550</b>.",
    "q3": "What sums are performed here?",
    "a3": "During development (07/27/2024) the damage calculation was based on (and some modifications) as described by <b>marauder</b> on 06/06/2024 via the website: <a href=\"https ://wutheringwaves.gg/damage-calculation-guide/\" target=\"blank_\">WutheringWaves.gg</a>.<br/>The basis for calculating enemy defense was used from Wutheringwaves.gg , and part of <a href=\"https://wutheringwaves.fandom.com/wiki/Damage#RES_Multiplier\">WutheringWaves Fandom</a> specifically the Resistance part.<br/>However, after failing To approximate accurately with the calculations presented, a manual \"test\" was carried out with some characters and enemies, arriving at an \"approximate\" percentage of standard resistance among enemies.",
    "q4": "Ok, but specifically what are the formulas?",
    "a4": "The method used was:<br/>1 - First we find what we will call here \"HIT\", where HIT = ATK * (Damage multiplier * Character scale).<br/>The <b>damage multiplier</b> is the % described in the character's skill, example: Stage 1 DMG <b>40.74%</b>, so the multiplier will be 40.74%.<br/>The <b>Character scale</b> are possible \"bonuses\" from the Resonance Chain, for example: Whenever physical damage is caused [...] it increases ATK by 3% up to 4 times..., so if the calculation is with \"all bonuses active\", it represents 12%.<br/><br/>2 - We now find what we will call <b>Expected Damage</b> (or EX) with the formula: HIT * (Elemental Bonus + Additional skill damage) * Other Bonus * Critical.<br/>HIT - Found in calculation 1.<br/>Elemental bonus, displayed on the character's status screen. Example: 80% Fusion.<br/>Additional skill damage: Added to % of elemental bonus from Echoes status, Example: 80% Fusion + 10% of the echos bonus = 90.00%.<br/>Other Bonus: If the character's Outro/Intro Skill has an influence on any damage.<br/>Critical: Multiplier when critical is activated. Uses Crit.DMG %.<br/><br/>3 - We then find the <b>Final Damage</b> (FD), where FD = EX * (Enemy Defense (DEF) + Enemy Resistance (RES)).<br/>EX: Found in calculation 2.<br/>DEF: Standard enemy defense of approximately 7% ~ 10% (on same Level).<br/>RES: Enemy elemental defense, if it doesn't have/is not your character's type: 0, if it is your character's type + 33%.<br/>The calculations for defense, resistance among others in none of the sources were confirmed as 100% accurate, so, with some tests carried out on different enemies, with different characters and abilities, we arrived at the closest value which is 7% ~10% reduced damage. If the elements are compatible, an additional 33%, totaling a total reduction of 40% ~ 43%.<br/><br/><br/>To exemplify the entire calculation, let's take a <b>Encore level 20</b>. With a <b>Training Rectifier level 1</b> weapon, with all its <b>skills still at level 1</b>. No additional bonuses and a base critical of 150%. <b>Fusion damage</b> additional 10%. The calculation would be as follows:<br/><br/>ATK = 110.<br/>Part 1 damage: 28%. (Damage multiplier).<br/>Resonance Chain: None. (Character scale).<br/><b><u>HIT</u></b> = 110 * (28% + 0%) = 30.8 .<br/><br/>Bonus Fusion: 10%.<br/>Echoes Attack Bonus: 28%.<br/>Other: Not added 0%.<br/>Critical: Possible 150%.<br/><b><u>EX</u></b> = 30.8 * (10% + 28%) * 1 * (1 or 150% if critical) = 11,704 (no critical) or 17,556 .<br/>NOTE: As there was no other skill, the calculation was set to 1 so as not to affect the count.<br/>Therefore, Wuthering Waves does not use decimals, we have the possible normal damage: 11, and possible critical 17, this, only in the Encore's \"First attack\". so EX = 11 | 17.<br/><br/>Now, we subtract the enemy's defense prediction:<br/>Final Damage = 11 | 17 - (7% | 40%) resulting in the following scenarios:<br/> - Common enemy, no critical: 8.<br/> - Common enemy, critical: 12.<br/> - Resistant enemy, no critical: 5.<br/> - Resistant enemy, critical: 8.<br/><br/>As we saw a margin of error of 5% to 7%, as the damage is low they can give \"1 less damage\" or \"1 more damage\", the values ​​will only be significant in much higher values ​​(example: calculation of 40,000 damage, can result in between 38,000 to 42,000 damage). However, you don't need 100% correct damage of how much you will hit the enemy since all possible variables will change this a lot, just a basis if your modification is improving or worsening your character as a whole.",
    "q5": "What is the difference between using this calculator and others?",
    "a5": "Some others available may be even more precise or have other features, but this one was made with \"something easier to fill in\" in mind, since some require specifying everything about your character (ex: Defense of an Encore, since he doesn't use DEF for anything in his damage), so each character only asks for what he uses to deal damage, and a calculation method that came closer to the values we saw in the game with our characters.",
    "q6": "How does this relate to Wuthering Waves or Kuro Games?",
    "a6": "Practically nothing except the use of skill and character names, this is a tool made by players for players. All rights remain with Kuro Games.",
    "q7": "Any cost to use the tools?",
    "a7": "Everything is free and made to be used for the benefit of the players, if you want to help you can visit the <a href=\"https://www.twitch.tv/zawthz\" target=\"blank\"> Zawthz TwitchTV channel</a><br/>. Or, if you help the developer through PLACEHOLDER (see what you can do here)",
    "q8": "How do I suggest my language to be added to the website?",
    "a8": "Send a message/DM to Zawthz's <a href=\"https://www.twitch.tv/zawthz\" target=\"blank\">TwitchTV channel</a><br/> and we'll see if we can translate it into your language."
}