{
    "q1": "Qual o objetivo do site?",
    "a1": "É normal que em jogos com elementos de RPG  dúvidas como \"o que é melhor fazer?\". Os calculos nesse site tem como objetivo ajudar a prever possíveis mudanças nos seus status e fazer com que seu personagem se adeque melhor ao seu modo de jogo.",
    "q2": "O quão confiaveis são os calculos?",
    "a2": "Bom, isso é realmente difícil de dizer, como Wuthering Waves (e praticamente todos outros jogos com elementos de RPG) possuem <b>N</b> variáveis para danos, como: Atk, Chance Critica, Armas, Efeitos especiais, Buff's, Debuff's, resistencias dos inimigos entre inumeras outras variações, determinar com exatidão um dano é difícil (para não dizer impossível) sem o código fonte/descrição exata de como cada mêcanica funciona.<br/><br/>Em testes realizados a \"previsão de dano\" se aproximou do dano esperado <i>in-game</i> com uma <b>variação sempre de 5%~7% em média</b>. Alguns exemplos:<br/> - Dano experado em inimigo sem resistência <b>806</b>, dano in-game <b>837</b>.<br/> - Dano experado em inimigo sem resistência (com buff de dano) <b>903</b>, dano in-game <b>911</b>.<br/> - Dano experado em inimigo com resistência <b>545</b>, dano in-game <b>550</b>.",
    "q3": "Quais calculos são realizados?",
    "a3": "Durante o desenvolvimento inicial 1.0 (27/07/2024 a 03/11/2024) o calculo do dano teve como base (e com algumas modificações) conforme descrito por <b>marauder</b> em 06/06/2024 através do site: <a href=\"https://wutheringwaves.gg/damage-calculation-guide/\" target=\"blank_\">WutheringWaves.gg</a>.<br/>A base para o calculo de defesa dos inimigos foi utilizada do Wutheringwaves.gg, e parte da <a href=\"https://wutheringwaves.fandom.com/wiki/Damage#RES_Multiplier\">Fandom da WutheringWaves</a> em especifico a parte de Resistência.<br/>Porém após não conseguir aproximar com exatidão com os calculos apresentados, foi feito um \"teste\" manual com alguns personagens e inimigos, chegando em uma porcentagem \"aproximada\" de resistência padrão entre os inimigos.",
    "q4": "Ok, mas especificamente quais são os calculos efetuados?",
    "a4": "Os cálculos são complexos, de forma mais \"visual\" recomendo verificar os links disponibilizados no tópico acima, porém de forma textual, uma resumo seria:<br/><br/>1 - Primeiro encontraremos um valor que vamos chamar de <b>HIT</b>, onde esse valor é resultado da seguinte expressão: ATK * (% da habilidade / 100) * 1.<br/>&nbsp;&nbsp;O ultimo 1, é referente a bônus de resonance chain, que não iremos utilizar no momento nesse site.<br/><br/>2 - Agora encontramos o <b>Dano Experado</b>, que vamos chamar de <b>EX</b>, ele é resultado da seguinte expressão: <b>HIT</b> * (1 + (elemental + bonus tipo) / 100) * 1 * 1<br/>&nbsp;&nbsp;Bonus tipo é referente ao tipo da habilidade: Ataque básico, Skill, Liberation e etc.<br/>&nbsp;&nbsp;Os últimos 1 são referentes a bônus de Outro Skill e múltiplicador crítico, que não estaremos utilizando até o momento.<br/><br/>3 - Com o <b>EX</b>, já temos o dano que podemos utilizar como base para saber se um personagem esta melhor, ou pior, mas, apenas por informativo é possível tentar prever o dano que realmente terá in-game<br/><br/>4 - o <b>Dano Final</b> (ou DF) é feito pela seguinte fórmula: DF = EX * (Defesa do inimigo + Resistência do inimigo). A defesa vária com diferença de nível, da elementos entre outros dados, ficando quase impossível prever com exatidão o dano, mas sempre vária entre NULO (100% de defesa) a 10% se o inimigo não tiver seu elemento, ou 40% se ele for do mesmo elemento. Isso quando seu personagem e o inimigo possuem o mesmo nível.<br/><br/>",
    "q5": "Porquê não foi utilizado Resonance Chain, Inherit Skills e Outro bônus?",
    "a5": "São informações muito váriaveis que só complicaria a vida, apenas pense o seguinte: Se considerar o personagem báse, sem o Resonance Chain, sem outros bônus, e após a mudança de algum status ele ficou mais forte, com os bônus fornecidos por essas habilidades, ele ficaria ainda mais forte... Então é mais simples, e prático considerar que os personagens sempre estão na sua forma base.",
    "q6": "Qual a diferença entre usar essa calculadora, entre outras?",
    "a6": "Algumas outras disponíveis podem ser até mais precisas ou possuir outras funcionalidades, porém essa foi feita pensando em \"algo mais facil de se preencher\" visto que algumas é necessário especificar tudo do seu personagem (ex: Defesa de uma Encore, sendo que ela não usa a DEF para nada em seu dano) então cada personagem pede apenas o que usa para dar dano, e de um metódo de calculo que chegou mais próximo dos valores que nós vimos in-game com nossos personagens.",
    "q7": "Como isso está relacionado com Wuthering Waves ou a Kuro Games?",
    "a7": "Práticamente em nada tirando o uso dos nomes de habilidades e personagens, algumas imagens e termos, é uma ferramente feita por jogadores para jogadores. Todos os direitos continuam pertencendo a KuroGames©.",
    "q8": "Alguns custo para usar as ferramentas?",
    "a8": "Tudo é gratuito, feito de fã para fã. Caso queira me ajudar você pode me pagar um café ou o que o seu coração mandar pelo Ko-Fi: <a href=\"https://ko-fi.com/nfekted\" target=\"blank_\" style=\"color: white\">clicando aqui</a>, e visitar a aba de parceiros, se algum Youtuber ou Streamer acabar conheçendo, e recomendando o site, posso acabar incluindo eles ali.",
    "q9": "Como sugerir um idioma para o site, relatar um BUG, informaçao desatualizada, feedback ou parceria?",
    "a9": "Entre em contato através <a href=\"https://forms.gle/kUUBYNQA39uYxfQ26\" target=\"_blank\">desse formulário.</a>"
}