{
    "q1": "What is the purpose of the website?",
    "a1": "It's normal in games with RPG elements to have doubts like \"what's best to do?\". The calculations on this site aim to help predict possible changes in your status and make your character better suited to your game mode.",
    "q2": "How reliable are the calculations?",
    "a2": "Well, that's really hard to say, as Wuthering Waves (and practically all other games with RPG elements) have <b>N</b> variables for damage, such as: Atk, Critical Chance, Weapons, Special Effects, Buff's, Debuff's, enemy resistances and countless other variations.<br/><br/>Determining damage accurately is difficult (not to say impossible) without the source code/exact description of how each mechanic works.<br/><br/>In tests carried out the \"prediction of damage\" approached the expected in-game damage with a <b>variation always of 5%~7% on average</b>. Some examples:<br/> - Damage expected on an enemy without resistance <b>806</b>, in-game damage <b>837</b>.<br/> - Damage expected on an enemy without resistance (with buff damage) <b>903</b>, in-game damage <b>911</b>.<br/> - Damage expected on enemy with resistance <b>545</b>, in-game damage <b>550</b>.",
    "q3": "What sums are performed here?",
    "a3": "During development of Version 1.0 (07/27/2024 to 03/11/2024) the damage calculation was based on (and some modifications) as described by <b>marauder</b> on 06/06/2024 via the website: <a href=\"https ://wutheringwaves.gg/damage-calculation-guide/\" target=\"blank_\">WutheringWaves.gg</a>.<br/>The basis for calculating enemy defense was used from Wutheringwaves.gg , and part of <a href=\"https://wutheringwaves.fandom.com/wiki/Damage#RES_Multiplier\">WutheringWaves Fandom</a> specifically the Resistance part.<br/>However, after failing To approximate accurately with the calculations presented, a manual \"test\" was carried out with some characters and enemies, arriving at an \"approximate\" percentage of standard resistance among enemies.",
    "q4": "Ok, but specifically what are the formulas?",
    "a4": "The calculations are complex, in a more \"visual\" way I recommend checking the links provided in the topic above, but in textual form, a summary would be:<br/><br/>1 - First we will find a value that we will call <b>HIT</b>, where this value is the result of the following expression: ATK * (% of the skill / 100) * 1.<br/>&nbsp;&nbsp;The last 1 refers to the resonance chain bonus, which we will not use at the moment on this site.<br/><br/>2 - Now we find the <b>Expected Damage</b>, which we will call <b>EX</b>, it is the result of the following expression: <b>HIT</b> * (1 + (elemental + type bonus) / 100) * 1 * 1<br/>&nbsp;&nbsp;Type bonus refers to the type of the skill: Basic Attack, Skill, Liberation and etc.<br/>&nbsp;&nbsp;The last 1 are related to Outro Skill bonuses and critical multiplier, which we will not be using for now.<br/><br/>3 - With <b>EX</b>, we already have the damage that we can use as a basis to know if a character is better or worse, but, just for information purposes, it is possible to try to predict the damage that will actually be done in-game<br/><br/>4 - <b>Final Damage</b> (or FD) is calculated using the following formula: FD = EX * (Enemy Defense + Enemy Resistance). Defense varies with level differences, elements, among other data, making it almost impossible to accurately predict damage, but it always varies between NULL (100% defense) to 10% if the enemy does not have your element, or 40% if he is of the same element. This is when your character and the enemy have the same level.<br/><br/>",
    "q5": "Why weren't Resonance Chain, Inherit Skills, and Outro bonuses used?",
    "a5": "This is very variable information that would only complicate de maths, just think about the following: If you consider the base character, without the Resonance Chain, without Outro bonuses, and after changing some status he became stronger, with the bonuses provided by these skills, he would be even stronger... So it is simpler and more practical to consider that the characters are always in their base form.",
    "q6": "What is the difference between using this calculator and others?",
    "a6": "Some others available may be even more precise or have other features, but this one was made with \"something easier to fill in\" in mind, since some require specifying everything about your character (ex: Defense of an Encore, since he doesn't use DEF for anything in his damage), so each character only asks for what he uses to deal damage, and a calculation method that came closer to the values we saw in the game with our characters.",
    "q7": "How does this relate to Wuthering Waves or Kuro Games?",
    "a7": "Practically nothing except the use of skill and character names, this is a tool made by players for players. All rights remain with Kuro Games.",
    "q8": "Any cost to use the tools?",
    "a8": "Everything is free, made by player for players. If you want to help me, you can donate a few cents or whatever your heart desires in Koffi: <pix code here>, and visit the partners tab. If any YouTuber or Streamer ends up knowing about the site and recommending it, I may end up including them there.",
    "q9": "How to suggest a language for the site, report a BUG, a outdated information, feedback or partnership?",
    "a9": "Please contact us using <a href=\"https://forms.gle/kUUBYNQA39uYxfQ26\" target=\"_blank\">this form.</a>"
}