{
    "q1": "Qual o objetivo do site?",
    "a1": "É normal que em jogos com elementos de RPG  dúvidas sobre \"o que é melhor fazer?\". Os calculos nesse site tem como objetivo ajudar a prever possíveis mudanças nos seus status e fazer com que seu personagem se adeque melhor ao seu modo de jogo.",
    "q2": "O quão confiaveis são os calculos?",
    "a2": "Bom, isso é realmente difícil de dizer, como Wuthering Waves (e praticamente todos outros jogos com elementos de RPG) possuem N variáveis para danos, como: Atk, Chance Critica, Armas, Efeitos especiais, Buff's, Debuff's, resistencias dos inimigos entre inumeras outras variações.<br/><br/>Determinar com exatidão um dano é difícil (para não dizer impossível) sem o código fonte/descrição exata de como cada mêcanica funciona.<br/><br/>Em testes realizados a \"previsão de dano\" se aproximou do dano esperado <i>in-game</i> com uma <b>variação sempre de 5%~7% em média</b>. Alguns exemplos:<br/> - Dano experado em inimigo sem resistência <b>806</b>, dano in-game <b>837</b>.<br/> - Dano experado em inimigo sem resistência (com buff de dano) <b>903</b>, dano in-game <b>911</b>.<br/> - Dano experado em inimigo com resistência <b>545</b>, dano in-game <b>550</b>.",
    "q3": "Quais calculos são realizados?",
    "a3": "Durante o desenvolvimento (27/07/2024) o calculo do dano teve como base (e com algumas modificações) conforme descrito por <b>marauder</b> em 06/06/2024 através do site: <a href=\"https://wutheringwaves.gg/damage-calculation-guide/\" target=\"blank_\">WutheringWaves.gg</a>.<br/>A base para o calculo de defesa dos inimigos foi utilizada do Wutheringwaves.gg, e parte da <a href=\"https://wutheringwaves.fandom.com/wiki/Damage#RES_Multiplier\">Fandom da WutheringWaves</a> em especifico a parte de Resistência.<br/>Porém após não conseguir aproximar com exatidão com os calculos apresentados, foi feito um \"teste\" manual com alguns personagens e inimigos, chegando em uma porcentagem \"aproximada\" de resistência padrão entre os inimigos.",
    "q4": "Ok, mas especificamente quais são os calculos efetuados?",
    "a4": "O método utilizado foi:<br/>1 - Primeiro encontramos o que chamaremos aqui de \"HIT\", onde HIT = ATK * (Múltiplicador de dano * Escala do personagem).<br/>O <b>múltiplicador de dano</b> é a % descrita na habilidade do personagem, exemplo: Stage 1 DMG <b>40.74%</b>, então o múltiplicador será o 40.74%.<br/>A <b>Escala do personagem</b> são possíveis \"bonus\" da Resonance Chain.<br/><br/>2 - Encontramos agora o que vamos chamar de <b>Dano Esperado</b> (ou EX) com a conta: HIT * (Bonus Elemental + Dano adicional de habilidade) * Bonus de Outro * Critico.<br/>HIT - Encontrado no calculo 1.<br/>Bonus elemental, visualizado na tela de status do personagem. Exemplo: 80% de Fusion.<br/>Dano adicional de habilidade: Soma-se a % de bonus através dos Echos, Exemplo: 80% do Fusion + 10% de bonus do echo = 90%.<br/>Bonus de Outro: Caso a Outro Skill do personagem tenha influência sobre algum dano.<br/>Crítico: Multiplicador quando crítico é ativado. Usa o Crit.DMG %.<br/><br/>3 - Encontramos então, o <b>Dano Final</b> (DF), onde DF = EX * (Defesa do Inimigo(DEF) + Resistência do Inimigo(RES)).<br/>EX: Encontrado no calculo 2.<br/>DEF: Defesa padrão do inimigo de aproximadamente 7% a 10% quando no mesmo level do seu personagem.<br/>RES: Defesa elemental do inimigo, se não tiver/não for o tipo do seu personagem: 0, se for do tipo do seu personagem + 33%.<br/>Os calculos para defesa, resistência entre outros em nenhuma das fontes foi confirmada como 100% exata, então, com alguns testes realizados em diferentes inimigos, com diferentes personagens e habilidades, chegamos ao valor mais próximo que é de 7% a 10% de dano reduzido. Se os elementos forem compativeis, 33% adicionais, totalizando de 40% a 43% de redução total.<br/><br/><br/>Para exemplificar todo calculo, vamos pegar uma <b>Encore nível 20</b>. Com uma arma <b>Training Rectifier nível 1</b>, com todas suas <b>habilidades ainda no nível 1</b>. Sem bonus adicionais e crítico base de 150%. <b>Dano Fusion</b> adicional de 10%. O calculo seria o seguinte:<br/><br/>ATK = 110.<br/>Part 1 damage: 28%. (Múltiplicador de dano).<br/>Resonance Chain: Nenhum. (Escala do personagem).<br/><b><u>HIT</u></b> = 110 * (28% * 1+0%) = 30.8 .<br/><br/>Bonus Fusion: 10%.<br/>Bonus de ataque basico através de echos: 28%.<br/>Outro: Não adicionado 0%.<br/>Critico: Possível 150%.<br/><b><u>EX</u></b> = 30.8 * (10% + 28%) * 1 * (1 ou 150% se critico) = 11,704 (sem critico) ou 17,556 .<br/>OBS: Como não teve outro skill, o calculo foi colocado como 1 para não afetar a conta.<br/>Sendo assim, Wuthering Waves não usa decimais, temos os possiveis danos normais: 11, e possível critico 17, isso, apenas no \"Primeiro ataque\" da Encore. então EX = 11 | 17.<br/><br/>Agora, subtraimos a previsão de defesa do inimigo:<br/>Dano Final = 11 | 17 - (7% | 40%) resultando nos seguintes cenários:<br/> - Inimigo comum, sem crítico: 8.<br/> - Inimigo comum, crítico: 12.<br/> - Inimigo resistênte, sem crítico: 5.<br/> - Inimigo resistênte, crítico: 8.<br/><br/>Como vimos uma margem de erro de 5% a 7%, como os danos são baixos eles podem dar \"1 de dano a menos\" ou \"1 de dano a mais\", os valores serão só significantes em valores muito maiores (exemplo: calculo de 40,000 de dano, pode resultar entre 38,000 a 42,000 de dano). Porém, você não precisa de danos 100% corretos de quanto acertará no inimigo uma vez que todas as variaveis possíveis vão alterar muito isso, apenas uma base se sua modificação está melhorando ou piorando seu personagem como um todo.",
    "q5": "Qual a diferença entre usar essa calculadora, entre outras?",
    "a5": "Algumas outras disponíveis podem ser até mais precisas ou possuir outras funcionalidades, porém essa foi feita pensando em \"algo mais facil de se preencher\" visto que algumas é necessário especificar tudo do seu personagem (ex: Defesa de uma Encore, sendo que ela não usa a DEF para nada em seu dano) então cada personagem pede apenas o que usa para dar dano, e de um metódo de calculo que chegou mais próximo dos valores que nós vimos in-game com nossos personagens.",
    "q6": "Como isso está relacionado com Wuthering Waves ou a Kuro Games?",
    "a6": "Práticamente em nada tirando o uso dos nomes de habilidades e personagens, algumas imagens e termos, é uma ferramente feita por jogadores para jogadores. Todos os direitos continuam pertencendo a KuroGames©.",
    "q7": "Alguns custo para usar as ferramentas?",
    "a7": "Tudo é gratuito e feito para ser usado para beneficio dos jogadores, caso queira ajudar você pode visitar o canal da <a href=\"https://www.twitch.tv/zawthz\" target=\"blank\"> TwitchTV do Zawthz</a><br/> que sempre me apoiou nas idéias malucas. Ou se quizer me ajudar diretamente você pode me dar uma gorjeta <a href=\"https://ko-fi.com/nfekted\" target=\"blank\">Através do Ko-Fi clicando aqui</>, vou ficar muito agradecido :)",
    "q8": "Como sugerir meu idioma para ser adicionado no site?",
    "a8": "Preencha o formulário e avaliaremos a possibilidade de incluir seu idioma, <a href=\"https://docs.google.com/forms/d/e/1FAIpQLScDsMIZq6RfbNFswl1reW7V4sKilAw2X_cjhoLNsCkS5txzVw/viewform\" target=\"blank\"> o formulário pode ser acessado clicando aqui</a>."
}